# OpaqueMfp Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedOpaque..::..OpaqueMfp Property
AdvancedOpaque Class See Also
---
The property labeled "Translucency Depth" from the "AdvancedOpaque" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string OpaqueMfp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpaqueMfp As String
	Get
```

Visual C++
---
```text
public:
static property String^ OpaqueMfp {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace